{"slug":"a-la-conquete-des-bugs","filename":"2014-10-21-a-la-conquete-des-bugs","title":"À la conquête des bugs","date":"Tue, 21 Oct 2014 00:00:00 GMT","draft":false,"meta":{"date":"2014-10-21T00:00:00.000Z","title":"À la conquête des bugs","author":"magsout","oldSlug":"webcompat","slug":"a-la-conquete-des-bugs"},"body":"<p>Le Web, depuis sa création est un vaste champ de bataille. Que ce soit les\nproblèmes de compatibilités, les formats ou les langages propriétaires, la\nvolonté de faire du Web un monde ouvert ne date pas d'hier.</p>\n<h2>Au départ</h2>\n<p>Les débuts du Web furent compliqués. On assista à une guerre entre Netscape et\nMicrosoft. Chacun voulant dominer le marché, en tentant d'imposer ses propres\ntechnologies. En 1996, Netscape propose au W3C JSSS (JavaScript-Based Style\nSheets). Ce n'est d'ailleurs que depuis novembre 2000 que Netscape, basé sur le\nmoteur Gecko (moteur de Mozilla Firefox), prend véritablement en charge le CSS.\nMicrosoft pour sa part ne supportait par JavaScript à ses débuts et avait\ndéveloppé son propre langage JScript.</p>\n<p>Ces problèmes de compatibilités, de technologies et de respect des normes vont\nconsidérablement ralentir l'évolution du Web.</p>\n<h2>Les petits nouveaux</h2>\n<p>L'arrivée des nouveaux navigateurs tels que Firefox, Chrome ou même Opera va\ninverser cette tendance. Les parts de marchés d'Internet Explorer baissant, les\ndéveloppeurs prenant conscience du potentiel du Web, vont déclencher une montée\nen puissance du Web.</p>\n<p>On pourrait croire que cette concurrence ne va apporter que des points positifs,\nmais pas tant que ça. Les parts de marchés vont pousser les navigateurs (ou les\ndéveloppeurs) à supporter des propriétés non standardisées, à mettre en place\ndes préfixes et à développer une monoculture.</p>\n<h2>Le début des problèmes</h2>\n<p>Les préfixes bien que partis d'une bonne idée, avaient pour objectif\nd'introduire les nouvelles propriétés CSS toujours à l'état de\nproposition/discussion/standardisation. Cela a permis de pouvoir utiliser des\npropriétés telles que <code>border-radius</code>, <code>transform</code>, <code>box-shadow</code> bien avant\nleurs finalisations. Le risque bien entendu, étant d'utiliser des propriétés qui\npouvaient changer de spécification, comme ce fut le cas par exemple pour\n<code>flexbox</code>.</p>\n<p>L'effet pervers a été aussi de ne pas utiliser tous les préfixes d'une\npropriété. Cela a eu pour conséquence de créer un Web (notamment sur le mobile)\nà deux facettes. Nous avions d'un coté les sites <code>-webkit</code> compatibles\niPhone/iPad et le reste du monde.</p>\n<p>Opera a d’ailleurs\n<a href=\"http://thenextweb.com/insider/2013/02/13/opera-300-million-users-webkit/\">abandonné</a>\nson moteur Presto en février 2013 au profit du moteur WebKit.</p>\n<p>Plusieurs discussions houleuses ont d'ailleurs eu lieu sur l’implémentation des\npropriétés <code>-webkit</code> dans les moteurs Gecko ou Presto. Idée abandonnée en cours\nde route.</p>\n<p>Coup de théatre\n<a href=\"http://blogs.msdn.com/b/ie/archive/2014/07/31/the-mobile-web-should-just-work-for-everyone.aspx\">récemment</a>,\nMicrosoft a intégré dans son moteur certaines propriétés <code>-webkit</code> pour obtenir\ndes sites Web mobiles (trop basés sur <code>-webkit</code>) compatibles avec Windows Phone\n8.1.</p>\n<h2>Un début de solution ?</h2>\n<p>C'est dans ce contexte qu'est née l'initiative\n<a href=\"http://webcompat.com\">webcompat.com</a>. Lancée initialement par des développeurs\nde chez <a href=\"https://hacks.mozilla.org/2014/06/introducing-webcompat-com/\">Mozilla</a>\net quelques autres\n<a href=\"https://github.com/webcompat/webcompat.com/graphs/contributors\">contributeurs</a>\nen juin 2014.</p>\n<p>Le site a un double objectif : rendre le Web le plus compatible possible et\néliminer les bugs.</p>\n<p>Le site accepte toutes sortes de bugs, que ce soit un problème de compatibilité\nentre navigateurs (<code>prefixe</code>, <code>sniffing UA</code>, etc), ou tout simplement un bug\nd'affichage, que vous soyez propriétaires ou simple utilisateurs du site.</p>\n<p>Une fois le bug soumis, quiconque a la possibilité de proposer un diagnostic, de\ncorriger le bug, voir de transmettre la solution aux équipes techniques du site\nen question (par Twitter, e-mail, GitHub, etc).</p>\n<p>Le projet est libre et appartient à sa communauté.</p>\n<p>Tout contributeur peut intervenir sur le site webcompat.com pour le\n<a href=\"https://github.com/webcompat/webcompat.com/issues?q=is%3Aopen+is%3Aissue+label%3Ahelp-wanted\">développement</a>,\nou même le\n<a href=\"https://github.com/webcompat/webcompat.com/issues?q=is%3Aopen+is%3Aissue+label%3Adesign\">design</a>.\nMais bien sûr et surtout sur la correction de\n<a href=\"https://github.com/webcompat/web-bugs/issues?q=is%3Aopen+is%3Aissue\">bugs</a>.</p>\n<p>Microsoft vient d'ailleurs de\n<a href=\"http://blogs.msdn.com/b/ie/archive/2014/07/31/the-mobile-web-should-just-work-for-everyone.aspx\">rejoindre</a>\nMozilla sur l'initiative webcompat.com. En lançant leur dernière version de\nWindow Phone 8.1 ils ont constaté les\n<a href=\"https://github.com/webcompat/web-bugs/issues?q=is%3Aissue+is%3Aopen+is%3Aclosed+label%3Aie\">dégâts</a>\nde la monoculture des sites mobile.</p>\n<p>Si comme eux, vous souhaitez rendre le Web plus compatible, n'hésitez pas à\nproposer votre aide. En effet, il est de notre responsabilité d’éviter tout\nmonopole ou monoculture. Car même si les navigateurs ont leur part de\nresponsabilité, nous, développeurs en avons une aussi.</p>\n"}