{"slug":"auto-entreprenariat-retour-d-experiences","filename":"2014-10-30-auto-entreprenariat-retour-d-experiences","title":"L'auto-entrepreneuriat : retour d'expériences","date":"Thu, 30 Oct 2014 00:00:00 GMT","draft":false,"meta":{"date":"2014-10-30T00:00:00.000Z","title":"L'auto-entrepreneuriat : retour d'expériences","author":"MoOx","oldSlug":"entreprendre/auto-entrepreneuriat-retour-experiences","slug":"auto-entreprenariat-retour-d-experiences"},"body":"<p>L'auto-entreprenariat, voilà la belle idée. Un statut facile qui permet à\nn'importe qui de créer sa propre entreprise. Une belle opportunité pour se\nlancer facilement et sans trop de risque à l'indépendance.</p>\n<p>Chômeur ? Cela vous permet de créer votre propre travail et de toucher tout de\nmême vos aides sociales (en soustrayant certes vos gains).</p>\n<p>En CDI ? Cela permet de vous aventurer en dehors de votre travail principal sur\ndes tâches que vous n'avez pas forcément l'occasion de faire comme gérer un\nclient, effectuer des factures, échanger avec l'administration (ah quel plaisir,\nça).</p>\n<p>Étudiant(e) ? Cela peut sérieusement vous aider à financer (malheureusement ?)\nvos études ou à être plus indépendant(e) de vos parents.</p>\n<p>Tant de raisons qui peuvent vous pousser à vous ouvrir à l'auto-entreprise. Et\npour ça, <a href=\"http://kud.io/\">_kud</a> et <a href=\"http://moox.io/\">MoOx</a> ont vécu cette\nexpérience et vous proposent de répondre à quelques questions pour vous faire\nune petite idée.</p>\n<h2>Pourquoi avez-vous créé votre entreprise ?</h2>\n<h5><strong>_kud</strong></h5>\n<p>Étant déjà en CDI et étant souvent sollicité pour créer des petits sites à\ndroite à gauche, je voulais m'initier à plusieurs choses comme la création\nd'entreprise, l'indépendance, me confronter à l'administration et surtout gérer\nun client.</p>\n<p>Et puis bon, cela me permettait aussi d'avoir un petit bonus non désagréable en\nfin de mois.</p>\n<h5><strong>MoOx</strong></h5>\n<p><em>Travailler plus pour gagner plus</em>, au départ ça devait être pour cette raison.\nJe n'avais pas de quoi frimer à la sortie de l'école, et je pouvais encore moins\nme payer de la blanche. Il me fallait donc une solution (rires). Plus\nsérieusement, dans le fond, tout comme Erwann, j'avais sûrement envie de tester\nun modèle plus indépendant que le CDI, en attendant que\n<a href=\"http://revenudebase.info/comprendre-le-revenu-de-base/\">le revenu de base</a>\nvienne bien démolir le modèle actuel.</p>\n<h2>Comment s'inscrire ?</h2>\n<p>C'est relativement simple. Il faut aller sur le\n<a href=\"http://www.lautoentrepreneur.fr/\">site de l'auto-entrepreneur</a> et remplir le\nformulaire.</p>\n<h5><strong>_kud</strong></h5>\n<p>En ce qui me concerne, j'ai choisi &quot;Prestations de services informatiques&quot;, ce\nqui me permettait d'être plutôt libre sur mes actions :</p>\n<ul>\n<li>donner des cours d'informatique ;</li>\n<li>créer des sites web ;</li>\n<li>faire de la réparation (même si ce n'est pas vraiment un cas que je souhaitais\nenvisager).</li>\n</ul>\n<h5><strong>MoOx</strong></h5>\n<p>Dans la pratique, l'inscription peut en effet être très rapide. Cela dit, je me\nrappelle m'être pris la tête avec le choix des mutuelles (choix qui, si tu as\ndéjà un CDI, ne sert pas vraiment à grand-chose à ce que j'ai fini par\ncomprendre). Pour ce qui est du code, j'avais pris &quot;Programmation informatique&quot;\n(6201Z) car je ne regardais pas vraiment plus loin que le bout de mon nez à\nl'époque (2010). Après, on n'ira pas vous ennuyer avec ça, je pense.</p>\n<h2>Qu'avez vous fait avec ?</h2>\n<h5><strong>_kud</strong></h5>\n<p>C'est une bonne question.</p>\n<p>J'ai passé quelques soirées et week-end à faire des sites en urgence, chose pas\nforcément agréable car peu d'apprentissage côté technologie... Mais par contre\ngérer le client était très passionnant.</p>\n<p>J'ai aussi, à ma surprise, réussi à donner des cours. Deux fois. Une fois une\nsemaine avec des licences sur le thème de la création de sites mobiles en\n<em>single page</em> avec du <a href=\"http://backbonejs.org/\">backbone.js</a> entre autres. Une\nautre fois à des gens en reconversion. Le but était de leur apprendre à créer\nleur propre site web (statique) ainsi qu'à comprendre (brièvement) comment\nmarchaient Internet et le Web. J'ai tout bonnement <strong>adoré</strong>.</p>\n<p>(Je sens que MoOx va encore dire &quot;pareil qu'Erwann&quot;...)</p>\n<h5><strong>MoOx</strong></h5>\n<p>Pareil qu'Erwann (<strong>_kud</strong>: <em>bingo</em>), au début c'était forfait soir et week-end\nde temps en temps. J'ai pris quelques petits projets sur mesure ou &quot;du WordPress\npour manger&quot; (2 fois seulement je le jure). Ensuite ça m'a fatigué mine de rien,\npuis j'avais d'autres priorités même si mon seul salaire en CDI pour nourrir 2\nbouches était juste. J'ai donc arrêté un moment, sans pour autant fermer l'AE\n(étant donné qu'au début, 0 CA = 0 charge). Mais c'est là où mon expérience avec\nl'AE est intéressante. J'ai laissé dormir le truc.</p>\n<p>Puis par la suite,\n<a href=\"https://vincent.jousse.org/blog/et-si-le-cdi-etait-une-connerie/\">le CDI étant ce qu'il est</a>\navec ses bons et surtout ses mauvais côtés, un jour après que le projet sur\nlequel j'ai été embauché soit jeté à la poubelle et que je doive me rabattre sur\nd'autres tâches qui ne m'amusaient plus du tout, j'ai décidé de démissionner.\nMais bon, c'était une situation un peu tendue, car je n'avais rien en plan B.\nQui dit démission, dit &quot;démerde-toi&quot;. Et à Toulouse, des boulots intéressants\ndans le web, si tu veux faire autre chose que du PHP, c'est un peu tendu du\n<code>string</code>.</p>\n<p>En cherchant, j'ai découvert un truc sympa : la\n<a href=\"http://travail-emploi.gouv.fr/informations-pratiques,89/les-fiches-pratiques-du-droit-du,91/rupture-conventionnelle-du-contrat,1208/la-rupture-conventionnelle-du,8383.html\">rupture conventionnelle</a>.\nPour faire simple, c'est une démission à l'amiable avec ton patron. Il faut son\naccord et tout le tralala administratif, mais à partir du moment où tu es en\nbons termes avec ton patron (et s'il n'est pas assez stupide pour dire des\nchoses du genre &quot;si tu veux te barrer, barre-toi, je ne lâcherai pas un sou&quot;),\nc'est une façon de partir et d'avoir droit aux indemnités chômage (pour peu que\ntu aies assez cotisé, bien entendu). Avec cette solution, je pouvais partir, en\nsachant que mes cotisations pour Pôle Emploi n'étaient pas inutiles. Clairement,\nmon but n'était pas de vivre de ça (avec même pas 60 % de mon salaire qui était\ndéjà juste, je vous laisse imaginer la misère) mais c'était plus d'avoir un\nparachute, pour éviter d'aller pleurer à papa et maman pour pouvoir payer le\nloyer et le crédit de mon A3 (sans quoi j'aurais été forcé de ne manger que des\npâtes achetées par sachet de 20 kg). Blague à part, je partais en ayant une\nbotte de paille en bas de ma chute, histoire de pas me casser toutes les côtes\nsi je ne trouvais rien où m'accrocher au passage.</p>\n<p>Je me lance donc dans une recherche effrénée, principalement pour du télétravail\n(car ça marchait pour moi depuis un moment, même si en France faut s'accrocher\npour trouver des entreprises ouvertes à ce mode de travail). Et cette fois-ci\n(car je démissionnais souvent, par ennui :/), j'ai eu du mal à trouver chaussure\nà mon pied. Beaucoup de mal. Et j'étais mal. Mais c'était sans compter que\nl'Internet, c'est un réseau mondial. Avec un peu de bonne volonté, j'avais\ntrouvé de quoi bénéficier d'une visibilité mondiale (no shit). Une fois via\n<a href=\"http://gun.io\">gun.io</a> et une fois via Twitter (pour trouver du boulot en fait\nc'est pas mal, via quelques tweets et retweets). Finalement, j'ai rapidement pu\nbosser pour des entreprises situées aux USA (no shit²).</p>\n<p>Le fait de ne pas avoir fermé l'AE a simplifié beaucoup de choses : je pouvais\nfaire des factures là, de suite. Puis aux États-Unis, ça ne rigole pas, ça ne\npaye pas comme en France à 30 ou 45 jours, ça payait tous les 15 jours, le jour\noù tu envoies la facture. BONHEUR.</p>\n<p>Bon, par contre attention, quand tu bosses avec des gens qui considèrent bien\nton travail, et qui te mettent sur un piédestal (tu es en position de force cher\ndéveloppeur, je te laisse à l'étymologie du nom de métier) plutôt que de te\nprendre pour la dernière roue du carrosse, tu vas vite dépasser le plafond\nimposé par l'AE (no shit³).\n<a href=\"https://gist.github.com/tibastral/8301072\">Et il n'y a pas que mon expérience qui vous le dira</a>.</p>\n<p>Pour l'anecdote, je n'ai demandé les indemnités de chômage que deux mois\nseulement sur près d'un an en situation freestyle (avant que je change pour un\nvrai statut).</p>\n<p>Du coup, pour moi l'AE aura été une bonne transition entre CDI, situation\nprécaire et ma situation actuelle de freelance. J'ai bien entendu changé\nrapidement de statut depuis (pour passer simplement à l'AE Level 2,\nl'<a href=\"http://www.apce.com/pid1628/l-entreprise-individuelle.html?espace=1&amp;tp=1\">entreprise individuelle</a>.</p>\n<h2>Que deviez-vous déclarer ?</h2>\n<p>Oui, parce que c'est bien beau tout ça mais qui dit statut administratif dit\ndéclaration.</p>\n<h5><strong>_kud</strong></h5>\n<p>Tous les trimestres, je me devais de <a href=\"http://www.net-entreprises.fr/\">déclarer</a>\nce que je facturais à mes clients et je payais directement mes impôts via le\nversement libératoire.</p>\n<p>Bon, je vous avoue que j'ai mis du temps à comprendre où je devais déclarer car\nvous avez trois champs à remplir, et quand vous ne comprenez rien au charabia\nadministratif, c'est pas super facile.</p>\n<p>Bref, une fois que vous avez déclaré vos revenus, un impôt se calcule\nautomatiquement et vous êtes débité(e) à la date indiquée.</p>\n<p>Plutôt simple dans l'idée.</p>\n<h5><strong>MoOx</strong></h5>\n<p>J'avais choisi aussi le versement libératoire, même constat. Il ne faut pas\nhésiter à prendre le téléphone pour obtenir une réponse pertinente au plus vite\nsans perdre de temps. Se rendre sur place dans le lieu adéquat est encore une\nmeilleure idée pour être sûr de ne pas se tromper.</p>\n<h2>Avez-vous eu des surprises ?</h2>\n<h5><strong>_kud</strong></h5>\n<p>Tout d'abord, ce qui est quelque peu déstabilisant, c'est la quantité de\ncourriers reçus. Prévoyances, mutuelles, maaaaaass papiers. En fait, c'est pas\ntant la quantité qui déstabilise, ce sont plutôt les propos. &quot;Vous avez créé une\nentreprise, c'est bien. Savez-vous que vous êtes dans l'obligation de souscrire\nà une mutuelle/prévoyance ?!&quot;.</p>\n<p>Si vous n'êtes pas un tant soit peu renseigné(e), vous tomberez dans le piège et\nvous souscrirez à des choses dont vous n'avez pas du tout besoin.</p>\n<p>En effet, lorsque vous vous inscrivez à l'URSSAF, celle-ci met par la suite à\ndisposition son fichier d'entreprises à différents organismes et ces derniers\nn'hésitent pas à vous mettre le grappin dessus afin que vous souscriviez à leurs\nformules pour qu'ils se fassent de la thune. Oui, car quand vous avez une\nentreprise, vous avez la plupart du temps des employés et dans ce cas, vous\ndevez souscrire à certaines obligations pour couvrir vos employés. Sauf que ce\nque ne précise pas l'URSSAF dans son fichier, c'est que vous êtes une entreprise\nd'auto-entrepreneur, et ça, ça change tout. Ouaip, vu que vous n'avez pas\nd'employé(e), vous avez un statut différent des autres boîtes et il n'est pas du\ntout question de souscrire à quoi que ce soit. Surtout des mutuelles ou\nprévoyances qui couvrent des employés inexistants. Vous avez tout à fait le\ndroit de souscrire à une mutuelle pour vous mais nullement pour votre\nentreprise.</p>\n<p>Pour ma part, une fois que j'eus compris ceci, j'ai tout jeté à la poubelle. :)\n(bande de vautours va).</p>\n<p>Passons à un autre domaine en terme de surprise : l'impôt sur votre revenu\nd'auto-entrepreneur.</p>\n<p>Moi qui pensais être tranquille en payant directement par versement libératoire,\nfoutaise !</p>\n<p>Alors oui, vous payez vos impôts directement dès que vous déclarez ce que vous\navez facturé. Ça, okay.</p>\n<p>Cependant, la chose que je n'avais pas calculée et dont personne ne m'avait\nprévenu : il n'est pas du tout pareil d'être auto-entrepreneur sans et avec un\ntravail à côté.</p>\n<p>Certes, on vous demandera de déclarer vos revenus annexes sur les impôts sur le\nrevenu seulement <strong>à titre informatif</strong>. Oui, vous ne paierez pas d'impôts\ndessus en plus. Mais par contre cela fera augmenter votre quotient familial.</p>\n<p>Explication. Si vous étiez de base à 10 % sur le revenu en impôts sur votre CDI,\nle fait que vous soyez en auto-entrepreneur et que vous gagniez de l'argent fait\nque votre quotient familial sera plus important et donc vous augmenterez le taux\nd'imposition sur votre CDI qui sera par exemple à 13,5 %, au lieu de 10 %\ninitiaux. Ce qui ne vous fera finalement pas un impôt à 23,5 % sur votre\nactivité d'AE (que vous payez directement chaque trimestre) mais plutôt 30 % du\nfait d'avoir un travail à côté.</p>\n<p>C'est tout à fait normal me direz-vous vu qu'il doit bien y avoir une différence\nentre une personne qui n'a que l'AE et une personne ayant déjà un job. Mais\nc'est juste que ce n'était pas du tout prévu dans mes calculs et en connaissance\nde cause, j'aurais sûrement augmenté mes tarifs AE.</p>\n<h5><strong>MoOx</strong></h5>\n<p>Ce qui m'a le plus surpris aussi c'est l'impression de me transformer en fichier\nvendu : je me suis aussi retrouvé à recevoir plein de courriers d'entreprise en\ntout sens. C'est d'un pénible...</p>\n<p>J'avais choisi aussi le versement libératoire, et mon faible revenu pour 2 parts\nà l'époque n'avait pas eu d'impact puisque je ne payais même pas d'impôts.</p>\n<h2>Si vous l'avez arrêté, pourquoi ?</h2>\n<h5><strong>_kud</strong></h5>\n<p>Je n'avais plus assez de temps pour moi. Les démarches m'ont un peu saoulé (même\ns'il y en avait vraiment pas beaucoup mais devoir constamment déclarer même si\nvous êtes à 0 € sous peine d'avoir une amende, ça fait chier).</p>\n<p>Je n'ai pas non plus apprécié voir mon taux d'impôts sur le revenu augmenter,\nc'était pas ce qui était &quot;vendu&quot; lorsque ce statut m'a été présenté.</p>\n<p>Et puis, je risquais de payer\n<a href=\"http://vosdroits.service-public.fr/professionnels-entreprises/F23547.xhtml\">la taxe CFE</a>\nd'ici l'année prochaine. Chose d'ailleurs qui n'est toujours pas claire d'après\nce que je peux lire sur Internet : les AE ne savent toujours pas si la CFE va\ndevoir être payée ou non.</p>\n<p>J'ai surtout constaté que je souhaitais avant tout donner des cours et à ce\nsujet, on m'a proposé une offre plus avantageuse que le statut d'AE, donc...</p>\n<h5><strong>MoOx</strong></h5>\n<p>Comme indiqué plus tôt, j'ai été limité par le plafond, j'ai donc passé la\nvitesse supérieure via une EI !</p>\n<h2>Comment arrêter</h2>\n<p>Aller sur le site de\nl'<a href=\"https://www.cfe.urssaf.fr/autoentrepreneur/CFE_Bienvenue\">AE</a> puis cliquer\nsur &quot;Cesser définitivement votre activité&quot; tout en bas. Un formulaire vous sera\nproposé où vous rentrerez vos informations puis il vous sera demandé de\nl'imprimer. Signez-le et envoyez-le à l'adresse uniquement (avec accusé de\nréception vivement conseillé).</p>\n<p>Vous recevrez dans les jours suivants un courrier de l'URSSAF vous indiquant que\nvous avez bien été radié(e).</p>\n<p>Oh et vous recevrez aussi du courrier de mutuelles ou prévoyances, comme\nd'habitude, à jeter. Du début à la fin, ils vous feront chier.</p>\n<h2>Conclusion</h2>\n<p>L'AE reste un très bon moyen de s'initier au freelance, à la création\nd'entreprise sans trop de risque. Les démarches sont plutôt simples, vous n'avez\npas besoin de comptable, et l'impôt est de l'ordre de 23 % à 35 % en fonction de\nvotre situation professionnelle initiale, ce qui est tout reste tout de même\nbien moins important que freelance ou une &quot;vraie&quot; entreprise.</p>\n<p>N'hésitez pas à vous en servir pour sortir de votre zone de confort !</p>\n<p>Dans tous les cas, si vous souhaitez en savoir plus, n'hésitez pas à aller sur\n<a href=\"http://www.economie.gouv.fr/cedef/auto-entrepreneur\">le site du gouvernement</a>.</p>\n"}