{"slug":"il-demarre-vim-par-erreur-ce-qui-se-passe-ensuite-est-tout-simplement-bluffant","filename":"2015-03-03-il-demarre-vim-par-erreur-ce-qui-se-passe-ensuite-est-tout-simplement-bluffant","title":"Il démarre Vim par erreur, ce qui se passe ensuite est tout simplement bluffant","date":"Tue, 03 Mar 2015 00:00:00 GMT","draft":false,"meta":{"date":"2015-03-03T00:00:00.000Z","title":"Il démarre Vim par erreur, ce qui se passe ensuite est tout simplement bluffant","author":"MoOx","oldSlug":"vim","slug":"il-demarre-vim-par-erreur-ce-qui-se-passe-ensuite-est-tout-simplement-bluffant"},"body":"<blockquote>\n<p>À première vue, vous allez éprouver de la tristesse, mais ce qui se passe\nensuite est tout simplement incroyable...</p>\n</blockquote>\n<blockquote>\n<p>Alors qu’il était en train d'effectuer une mise en production, ce développeur\ns'est confronté à une situation qui aurait pu complètement déraper. Une\nintervention directement sur le serveur de production était obligatoire afin\nd'éditer la base de données au format .txt.</p>\n</blockquote>\n<blockquote>\n<p>Après avoir passé plusieurs heures pour se connecter à distance via une\nconnexion sécurisée, Maxime est tombé nez à nez avec une console\nd'administration en ligne de commande ! Il était complètement désemparé par\nl'absence de fenêtre.</p>\n</blockquote>\n<blockquote>\n<p>Ce qui s’est passé ensuite est tout simplement incroyable : fort de sa\npersévérance, Maxime décide tout de même de se rapprocher du clavier ! Après\nune rapide recherche sur les Internets, il tape la première commande qu'il\ntrouve :</p>\n</blockquote>\n<blockquote>\n<pre><code class=\"hljs language-console\"><span class=\"hljs-meta\">$</span><span class=\"bash\"> vim</span>\n</code></pre>\n</blockquote>\n<blockquote>\n<p>Alors qu'on pourrait imaginer un drame, comme il arrive souvent quand\n<a href=\"https://duckduckgo.com/?q=I+am+stuck+in+VIM\">une personne tombe dans ce piège</a>,\nMaxime ne s'est pas laissé abattre et a persisté dans sa démarche...</p>\n</blockquote>\n<p>Bon, assez plaisanté.</p>\n<h2><em>Pourquoi j'essayerais Vim ?</em></h2>\n<p>J'ai commencé par Eclipse. Qu'il fallait réinstaller assez souvent sans quoi on\nperdait 10 minutes de sa vie à chaque ouverture d'autocomplete. Je suis passé\npar NetBeans, WebStorm... Sans être convaincu. Plus récemment, j'étais assez\ncontent sous Sublime Text avant d'essayer Atom (car en gros Atom est quasiment\nla même chose, en technologie web, open source et fait par GitHub). Mais j'ai\ntoujours eu envie de me la péter devant 2 écrans tout noir, en ligne de\ncommande, comme dans les super productions américaines.</p>\n<p>Plus sérieusement, je passe de plus en plus de temps devant ma console... Enfin\nvous savez, le terminal, pas l'autre truc un peu plus fun (et encore que).</p>\n<p>J'ai toujours eu envie de comprendre pourquoi autant de gens (car mine de rien\nil y en a un paquet) utilisaient Vim, et se moquaient un bon coup à chaque\nsortie d'un nouvel éditeur. Car bon faut avouer, se moquer c'est facile. Du coup\nun jour, j'ai démarré Vim.</p>\n<h2><em>Pourquoi j'ai rien compris quand je me suis retrouvé dans Vim ?</em></h2>\n<p>Le truc le plus déroutant dans Vim, c'est les modes. Et quand on ouvre Vim, on\nne se retrouve pas dans le mode le plus logique (à première vue).</p>\n<p>En fait, ce qu'on dit pas trop, c'est que Vim est toujours utilisé aujourd'hui\ncar on peut l'utiliser uniquement au clavier. Vous allez me répondre qu'on peut\nen faire de même avec tous les éditeurs de texte.</p>\n<p>Mais <strong>Vim a clairement été développé pour minimiser les déplacements des\nmains</strong>.</p>\n<p>C'est pour moi la chose la plus importante à retenir. Et la chose la plus\nattractive. Les bons développeurs ont tous une bonne flemme au fond d'eux, c'est\nbien connu.</p>\n<p>Pour un peu plus sur l'histoire de Vim, direction\n<a href=\"https://fr.wikipedia.org/wiki/Vim\">wikipedia.org/wiki/Vim</a>.</p>\n<h2>Commencer avec Vim</h2>\n<p>Du coup, quand je suis dans Vim, comment ça se passe ?</p>\n<p>Je passerai plus tard assez rapidement sur les différents points, vu que\nd'autres ressources, dont notamment le livre\n<a href=\"https://vimebook.com/\">Vim pour les humains</a>, le font très bien en douceur.</p>\n<p>C'est d'ailleur grâce à ce livre que je me suis lancé. Je tiens donc à remercier\n<a href=\"https://vincent.jousse.org/\">Vincent Jousse</a> pour avoir pris le temps d'écrire\ncet ouvrage.</p>\n<p>Profitez de cet ouvrage, en plus\n<a href=\"http://ploum.net/le-prix-libre-une-impossible-utopie/\">le prix est libre</a>. Et\npuis quand on pense au prix des licences de certains IDE...</p>\n<p>Ce livre est fait pour n'importe qui, débutant ou pas. Vraiment, mangez-en si\nvous souhaitez essayer Vim (oui je sais, manger un e-book comme ça, ça paraît\npas évident).</p>\n<p>J'ai essayé plusieurs fois sans trop savoir où commencer, sans succès. Ce livre\nm'a aidé et se dévore en quelques dizaines de minutes (deux ou trois heures\ngrand max), clavier sous les mains (bah oui rien de mieux pour se lancer).</p>\n<p>J'ai essayé et me voilà conquis, une fois que j'ai compris sa valeur ajoutée.</p>\n<p>Pour bien s'y prendre, forcez-vous à travailler avec Vim au moins une journée en\nsuivant les conseils que vous trouverez dans cet ouvrage. Cela a fonctionné pour\nmoi : je gagne déjà du temps au bout de quelques semaines d'utilisation.</p>\n<p>Pourquoi pas vous ?</p>\n<h2>Pour apprendre Vim</h2>\n<p>Vous pouvez donc :</p>\n<ul>\n<li>lire l'e-book <a href=\"http://vimebook.com\">Vim pour les humains</a></li>\n<li>lancer la commande <code>vimtutor</code></li>\n<li>jouer à <a href=\"http://vim-adventures.com/\">Vim Adventures</a></li>\n<li>vous entraîner sur des exemples concrets avec <a href=\"http://vimgolf.com/\">VimGolf</a></li>\n</ul>\n<p>Voici aussi un cheatsheet indispensable qui permet de bien mémoriser le pourquoi\ndes touches (b = begin, w = word, e = end, r = replace, i = insert, a = append,\no = open, ctrl f = forward, ctrl b = backward, etc).</p>\n<p><img src=\"/public/images/articles/2015-03-03-il-demarre-vim-par-erreur-ce-qui-se-passe-ensuite-est-tout-simplement-bluffant/vim-cheatsheet.gif\" alt=\"cheatsheet VIM\" /></p>\n<p>Vous remarquerez que souvent les commandes en majuscules font la même chose mais\ndans le sens inverse (f/F, o/O), ou de manière plus catégorique (d/D, y/Y).</p>\n<h2>Passer à Vim est un investissement</h2>\n<p>Point important : il faut avoir envie. Il ne s'agit pas de changer simplement\nd'éditeur, car on doit complètement changer ses habitudes. Plus aucun raccourci\nclavier que vous avez l'habitude d'utiliser ne va fonctionner. Je me répète mais\nil faut se forcer un minimum avant d'imaginer les possibilités de cet éditeur.</p>\n<p>Cela dit, on peut rapidement voir la puissance de Vim après quelques heures\nd'utilisation (même si on peut aussi un peu rager en cherchant des commandes\nsimples qu'on arrive pas à faire).</p>\n<p>Sachez aussi que beaucoup d'éditeurs ont des modes Vim (Sublime Text, Atom et\nd'autres). Il doit bien y avoir une raison, non ? Notez aussi que Vim est\ninstallé par défaut sur beaucoup d'environnement de type Unix.</p>\n<p>Vim est configurable à souhait (via le fichier <code>.vimrc</code>) et possède même son\npropre language de scripts (Vim Script ou viml) ce qui permet de créer de\nnouvelles fonctionnalités simplement. Et même du coup d'en faire des &quot;plugins&quot;.</p>\n<p>Je vous prépare un prochain post pour vous faire un petit mémo condensé de ce\nqu'on peut faire avec, et surtout comment.</p>\n<blockquote>\n<p>:q^C:wq</p>\n</blockquote>\n"}