{"slug":"qu-est-ce-que-l-integration-continue","filename":"2015-05-21-qu-est-ce-que-l-integration-continue","title":"Qu'est-ce que l'intégration continue ?","date":"Thu, 21 May 2015 00:00:00 GMT","draft":false,"meta":{"date":"2015-05-21T00:00:00.000Z","title":"Qu'est-ce que l'intégration continue ?","author":"MoOx","oldSlug":"ci","slug":"qu-est-ce-que-l-integration-continue"},"body":"<p>Certains risquent d'être déçus puisque nous ne parlerons pas ici des fameux\n<code>3x8</code>, technique qui consiste à faire tourner 3 équipes d'intégrateurs HTML en\ncontinu afin d'avoir du PSD &gt; HTML 24h sur 24.</p>\n<h2>Le principe de l'intégration continue</h2>\n<blockquote>\n<p>L'intégration continue est un ensemble de pratiques utilisées en génie\nlogiciel consistant à vérifier à chaque modification de code source que le\nrésultat des modifications ne produit pas de régression dans l'application\ndéveloppée.</p>\n</blockquote>\n<p><small>\n<a href=\"https://fr.wikipedia.org/wiki/Int%C3%A9gration_continue\">Source: Wikipédia</a>\n</small></p>\n<h2>Pré-requis pour mettre en place l'intégration continue</h2>\n<p>Avant de rentrer dans le vif du sujet, assurez-vous d'avoir déjà de bonne bases,\npour maintenir une base de code saine en\n<a href=\"/fr/articles/git/\">versionnant avec git</a>. Nous sommes en 2015, l'année où l'on\nétait censé avoir les voitures volantes, nous n'allons donc pas expliquer ici à\nquoi sert de versionner du code.</p>\n<p>Du code versionné ne suffit pas, il faut avoir des tests automatisés bien\nentendu. <a href=\"/fr/articles/js/tests/frontend/\">Front</a> et back, il en faut de tous\nles côtés.</p>\n<p>Ensuite, il nous faudra choisir un serveur qui va gérer l'intégration continue.\nIl existe des services tels que:</p>\n<ul>\n<li><a href=\"http://travis-ci.org/\">Travis</a></li>\n<li><a href=\"https://circleci.com/\">CircleCI</a></li>\n<li><a href=\"https://www.atlassian.com/software/bamboo/\">Bamboo</a></li>\n<li><a href=\"https://codeship.com/\">Codeship</a></li>\n<li><a href=\"http://jenkins-ci.org/\">Jenkins</a></li>\n</ul>\n<h2>L'intégration continue en pratique</h2>\n<p>Un fois qu'on a notre code testé et versionné et qu'on a configuré son serveur\nde <em>CI</em>, chaque modification va déclencher des actions sur ce serveur, puis, en\nfonction des résultats, va déclencher d'autres actions tout en vous notifiant si\nbesoin.</p>\n<p>Un exemple classique serait le suivant : une fois les dernières modifications de\ncode poussées sur la branche principale sur votre dépôt de code, le serveur\nd'intégration continue va jouer tous les tests et déployer le tout en production\nsi tout a marché sur des roulettes.</p>\n<p>Si des problèmes surviennent, rien ne sera déployé et vous serez notifié sur les\nservices que vous avez configurés (email, IRC, webhook, etc).</p>\n<p>Nous pouvons imaginer que votre serveur vienne vous insulter sur votre logiciel\nde chat interne, en vous montrant du doigt. On pourrait aussi imaginer une\nsynthèse vocale crier votre nom et préciser à toute l'équipe que\n<a href=\"https://www.youtube.com/watch?v=mbDcnUH6rOc\">vous avez merté</a> : <em>“MoOx, you\njust fucked up the build by breaking 42 tests! Fix that please”</em>. Pour finir\ndans les exemples farfelus, nous pourrions avoir une petite tourelle type <em>Nerf</em>\nqui vous met un petit headshot qui va bien. Des équipes font vraiment ça, et\nvous vous en doutez, y'a de la grosse marrade au programme.</p>\n<p>L'idée est vraiment de pousser le plus souvent possible, les plus petites\nmodifications possibles avec la meilleure couverture de tests possible. Ceci\nafin de minimiser les risques. De plus, cela aide à rester focalisé.</p>\n<p>Tout ce processus (versionné aussi tant qu'à faire), qui permet de jouer tous\nles tests <strong>rapidement</strong> (dans un environnement similaire à la production), doit\nêtre transparent et accessible localement, afin que les développeurs aient une\nbonne visibilité et une bonne compréhension du système en place.</p>\n<h2>Faire des tests automatisés, c'est la vie</h2>\n<p>J'ai mis un titre pour ça car c'est important. Vraiment. Tout développeur qui\nn'a pas encore écrit ses premiers tests a peur. Puis avec le temps, il se dit\nque finalement, il ne fallait pas avoir autant d'appréhension et qu'il était\ntrès con de ne pas avoir testé automatiquement tout ses codes sources plus tôt.\nÀ tel point qu'une\n<a href=\"http://the--kyza.deviantart.com/art/What-the-Flux-511691704\">DeLorean modifiée</a>\npour se prévenir soi-même ne serait pas de refus.</p>\n<p>Une fois la barrière franchie, on se dit vraiment qu'on était stupide de pas\navoir essayé avant.</p>\n<h2>Une commande qui exécute les tests</h2>\n<p>Un fois qu'on a écrit des tests, ou même souvent avant, on automatise\nl'exécution des tests. En général c'est rapide, étant donné qu'une simple\ncommande ou un simple script suffit. Beaucoup de <em>test runners</em> existent et vous\nn'aurez aucune difficulté à en trouver un en adéquation avec votre language\nfavori.</p>\n<p>Pour notre site, la commande est <code>npm test</code>. Simple, efficace.</p>\n<p>Elle exécute tout ce qui est nécessaire à compiler notre application et à jouer\nles tests tout en retournant un résultat lisible et un code d'erreur si besoin.</p>\n<h2>Et après ?</h2>\n<p>Là, si vous avez déjà mis tout ça en place, le bonheur ultime du développeur\nn'est pas loin : vous pouvez rapidement vérifier qu'il n'y a pas de régressions\net agir en conséquence.</p>\n<p>Chez <em>Putain de code !</em> (en date de cet article), notre couverture de tests est\nloin d'être bonne. Mais ce site étant un petit plaisir un peu risqué, nous\nfaisons quand même du\n<a href=\"/fr/articles/ci/deploiement-continu/\">déploiement continu</a>, l'étape d'après !\nOn aime bien l'idée du\n<em><a href=\"http://zachholman.com/talk/move-fast-break-nothing\">move fast &amp; break <del>no</del>thing </a></em>.</p>\n"}