{"slug":"stop-aux-npm-install-global","filename":"2017-11-30-stop-aux-npm-install-global","title":"Stop aux `npm install -g` sauvages (ou pourquoi vous ne devriez pas installer en global de packages et outils CLI)","date":"Thu, 30 Nov 2017 00:00:00 GMT","draft":false,"meta":{"date":"2017-11-30T00:00:00.000Z","title":"Stop aux `npm install -g` sauvages (ou pourquoi vous ne devriez pas installer en global de packages et outils CLI)","author":"MoOx","oldSlug":"npm/install-g","slug":"stop-aux-npm-install-global"},"body":"<p>À chaque fois qu’un développeur installe un outil globalement, une discussion\ntabs vs spaces commence. Et Dieu sait que c’est inutile. Les espaces c’est\nmieux. Fin de la discussion.</p>\n<p>À chaque fois qu’un développeur utilise un outil de développement global, un\nchaton meurt. Et Dieu sait que nous aimons les chats.</p>\n<p>Plus sérieusement, c’est une vraie question. Et une bonne question.</p>\n<h2>Pourquoi installer un outil de manière globale sur sa machine est une mauvaise idée?</h2>\n<p>On va tenter de répondre ici de manière constructive.</p>\n<p>La raison est simple et c’est la même raison pour laquelle aujourd’hui il y a\nYarn et npm 5 qui utilisent des fichiers <code>lock</code> : parce que vous voulez avoir\nl'assurance d'avoir la même version que vos collègues.</p>\n<p>Très souvent, dans le fond un outil CLI n’est rien de plus qu’une dépendance à\nun projet. Il est tout à fait (voire hautement) probable que sur deux projets\ndifférents développés à deux instants différents dans le temps vous ayez utilisé\ndeux versions différentes d’un outil.</p>\n<p>Le premier exemple de ma vie qui me vient en tête c’est les pré-processeurs CSS.\nÀ l’époque où j’utilisais Sass, il était courant que pour une raison X ou Y (par\nexemple une nouvelle fonctionnalité disponible dans une version majeure) que je\ndois mettre à jour la version pour le projet en cours. Mais que se passe-t-il\nalors pour tous mes anciens projets ? Vont-ils être compatibles ? Vont-ils avoir\ndes problèmes ? Vais-je devoir mettre mes autres projets à jour ? Cela va-t-il\nme faire chier d’une manière hors du commun ?</p>\n<p>Vous avez ici des vraies questions d'ordre pratique. Ça a dû arriver à tout le\nmonde d’avoir ce cas de figure.</p>\n<p>Et je vais ajouter à ceci un autre problème.</p>\n<h2>« mais puisse ke je te di ke sa marche cez moi ! »</h2>\n<p>On a tous travaillé à plus de deux développeurs sur un projet (et encore ça peut\nnous arriver tout seul au changement de machine)</p>\n<p>Le fameux « ça marche sur ma machine ». Celui-là qui prend grâve la tête.\nCelui-là qui peut nous faire perdre des heures à comprendre pourquoi ça marche\npas sur le PC des collègues.</p>\n<p>Celui-là qui énerve les personnes chez qui ça marche et ceux chez qui cela ne\nmarche pas. Oui ça fait clairement chier tout le monde.</p>\n<p>Du coup pour éviter ce problème, il y a une méthode simple.</p>\n<h2>Ne jamais (ô grand jamais) installer un outil de développeur globalement sur sa machine.</h2>\n<p>De rien. Voilà c’était un conseil gratuit.</p>\n<p>(Je détaillerai à la fin de cet article les seules raisons valables pour\nutiliser et installer globalement un package ou un outil CLI)</p>\n<p>Bon du coup pour éviter ce problème on a une solution extrêmement simple :\ninstaller localement à chaque projet TOUTES les dépendances.</p>\n<p>Il y a deux choses que peu de gens savent : la première est que npm et yarn vont\nautomatiquement ajouter tous les bin disponibles de tous les node_modules locaux\ndans le PATH utilisé via les scripts définis dans votre package.json.</p>\n<p>Du coup dans la pratique il vous suffit de vous faire un petit alias pour chaque\noutil CLI et le tour est joué.</p>\n<pre><code class=\"hljs language-js\">{\n  <span class=\"hljs-string\">&quot;scripts&quot;</span>: {\n    <span class=\"hljs-string\">&quot;cmd&quot;</span>: <span class=\"hljs-string\">&quot;cmd&quot;</span> <span class=\"hljs-comment\">// on assume qu&#x27;on a un outil qui offre le bin `cmd`</span>\n  }\n}\n</code></pre>\n<pre><code class=\"hljs language-console\">npm run cmd\n</code></pre>\n<p>À savoir avec npm il faudra rajouter des — à la fin d’une commande pour que cela\nfonctionne correctement si vous passez des arguments.</p>\n<pre><code class=\"hljs language-console\">npm run cmd -- arg\n</code></pre>\n<p>Avec Yarn, cela n’est pas nécessaire. C’est bien plus bref (et pratique).</p>\n<pre><code class=\"hljs language-console\">yarn cmd arg\n</code></pre>\n<p>Il faut savoir que pour les développeurs de ce type d’outil c’est aussi un petit\ncauchemar à gérer.</p>\n<p>Lorsqu’un outil a une package offrant une interface CLI, comment savoir si la\nversion de la bibliothèque fonctionnera avec ?</p>\n<p>De cette problématique est née une solution récurrente : les packages qui ont une\nCLI et une bibliothèque en parallèle vont très souvent avoir une CLI très light\nqui va en général consister à aller chercher dans le dossier de la bibliothèque\noù vous vous trouvez le vrai code à exécuter.</p>\n<p>Je dirais même que c’est plutôt cool dans un sens.</p>\n<p>Mais on voit bien ici qu’on a un petit problème car cela demande du travail\nsupplémentaire aux développeurs des projets qui sont déjà trop souvent à flirter\navec le burnout.</p>\n<h2>Petite astuce bien stylée</h2>\n<p>Vous pouvez ajouter tous les binaires de <code>node_modules/.bin</code> localement à votre\nPATH histoire de pouvoir les utiliser en CLI.</p>\n<pre><code class=\"hljs language-sh\"><span class=\"hljs-comment\"># to avoid npm install -g / yarn global add</span>\n<span class=\"hljs-built_in\">export</span> PATH=<span class=\"hljs-variable\">$PATH</span>:./node_modules/.bin\n</code></pre>\n<p>Une fois cette astuce réalisée, déposez dans votre <code>.bashrc</code> (ou<code>.zshrc</code>…), vous\npourrez utiliser des bin locaux à votre projet comme si ils avaient été\ninstallés globalement. Sans passer par alias. Mais ça ne marchera bien entendu\nqu’à la racine du projet. Ça reste bien pratique n’est-ce pas?</p>\n<p>(Et non, si vous faites ça dans l'ordre décrit plus haut, il n'y a pas de soucis\nde sécurité genre <em>&quot;un package remplace <code>rm</code> et fait ce qu'il veut avec mes\ndonnées&quot;</em> puisque la priorité sera donnée à la première partie du <code>PATH</code>.)</p>\n<h2>Alternative bien stylée</h2>\n<p>Si vous n'êtes pas fan de modifier votre <code>PATH</code>,\n<a href=\"https://www.npmjs.com/package/npx\"><code>npx</code></a> est un outil qui va justement\npermettre d'appeler les <code>node_modules/.bin</code> locaux sans le modifier.</p>\n<p>Ah mais comment on l'installe? Avec <code>-g</code> pardi ! Je plaisante. Il est inclus\navec <code>npm</code>. Faites un petit <code>which npx</code> pour vérifier!</p>\n<p>Dans tous les cas, <code>npx</code> fait partie des rares outils qui méritent d'être\ninstallés en global, ceux qui sont pour l'environnement du développeur, pas pour\nun projet.</p>\n<p>D'ailleurs parlons en de ces cas où <code>-g</code> est valide.</p>\n<h2>Les seuls cas valides où les outils globaux ont du sens</h2>\n<p>Les seuls cas valides sont pour des outils qui ne sont pas des outils liés à un\nprojet. C’est pas plus compliqué!</p>\n<p>Répétez avec moi: <em>&quot;Installer avec -g c'est pour mon environnement de\ndéveloppeur, rien qu'à moi. Pas pour un projet&quot;.</em></p>\n<p>En plus de <code>npx</code>, un très bon exemple serait\n<a href=\"https://www.npmjs.com/package/trash\"><code>trash(-cli)</code></a>, que je vous conseille\nd’utiliser en place de <code>rm -rf</code> (il va plus vite (déplace dans votre corbeille),\net permet donc la récupération, sait-on jamais). Et encore si vous l’utilisez\nsur un projet, pensez à l’ajouter aux dépendances (--dev)!</p>\n<p>Il en existera d'autres, mais rappelez-vous que <code>npm install -g</code> est clairement\ntrop souvent recommandé alors qu'il ne devrait pas l'être!</p>\n<p>N’hésitez pas à réagir à ces conseils.</p>\n<p>Bisous à tous 😘</p>\n<hr />\n<h2>Note sur <code>npx</code> et sa magie intégrée</h2>\n<p><code>npx</code> permet de télécharger automatiquement les packages. Par exemple tapez\n<code>npx mocha</code> et il vous installera le package <code>mocha</code> en global et ira même\njusqu'à s'occuper des mises à jour tout seul (en plus d'exécuter la commande,\npuisque c'est son but initial). Malheureusement, pour les raisons expliquées\nplus haut, je ne pense vraiment pas que ça soit une bonne idée. Que se\npasse-t-il si vous avez pris l'habitude d'utiliser <code>npx</code> et qu'un beau jour il\nvous télécharge (puisqu'il ne vous demande rien - c'est magique) une version\ncontenant un bug? Vous aurez l'air malin. Et cela n'empêche en rien le fameux\nproblème du &quot;ça marche sur ma machine&quot; puisque vous aurez potentiellement des\ncollègues qui ne l'utiliseront pas. Oui ceux qui ne lisent jamais les README et\nn'écoutent pas les recommandations...</p>\n<p>(Je vois encore trop souvent des gens utiliser <code>npm</code> sur des projets nécessitant\n<code>yarn</code> et qui viennent se plaindre de temps en temps que\n&quot;ça-marche-plus-j'ai-fait-rm-rf-node_modules-&amp;&amp;-npm-install-mais-c-est-pas-mieux&quot;)</p>\n"}