{"slug":"twitter-comme-lecteur-de-flux","filename":"2014-02-26-twitter-comme-lecteur-de-flux","title":"Twitter comme lecteur de flux","date":"Wed, 26 Feb 2014 00:00:00 GMT","draft":false,"meta":{"date":"2014-02-26T00:00:00.000Z","title":"Twitter comme lecteur de flux","author":"kud","oldSlug":"twitter/comme-lecteur-de-flux","slug":"twitter-comme-lecteur-de-flux"},"body":"<p><em>(Note : dans cet article, j'ai volontairement pris comme exemple la version Web\nafin que tout le monde puisse profiter de l'expérience mais il est évident que\nvous puissiez le faire avec votre application twitter favorite).</em></p>\n<p>Bien avant la fin de Google Reader, je me posais déjà la question de l'intérêt\nd'un lecteur de flux {rss|atom}. En effet, il m'était pénible d'organiser les\nflux que je souhaitais lire : les ranger par catégorie, supprimer les sites\nmorts ou ceux qui ne m'intéressaient plus; de plus, je n'ai jamais réellement\nutilisé les fonctionnalités d'un lecteur de flux comme le système de marquage,\nsavoir si le flux a été lu ou non, lire l'article dans le lecteur (je le lis\ntoujours sur le site, jamais dans l'application). Et puis c'est parfois pénible\nde trouver un lecteur de flux simple, multi-OS et gratuit.</p>\n<p>J'ai été un grand fan à l'époque de Netvibes puis je l'ai délaissé pour Google\nReader et nous voilà quelques temps après, sans réelle solution à mon sens pour\nlire agréablement des flux tel que je le concois.</p>\n<p>J'expérimente pourtant une solution depuis quelques mois qui me sied bien.\nJ'utilise en effet Twitter en tant que lecteur de flux. Oui, car cela a\nplusieurs avantages :</p>\n<ul>\n<li><p>Il existe une application pour\n<a href=\"https://play.google.com/store/apps/details?id=com.twitter.android&amp;hl=fr\">Android</a>,\n<a href=\"https://about.twitter.com/products/iphone\">iOS</a> ainsi que\n<a href=\"https://itunes.apple.com/fr/app/twitter/id409789998?mt=12\">Mac</a>; mais aussi\nla <a href=\"https://twitter.com/\">version Web</a> et\n<a href=\"https://tweetdeck.twitter.com/\">Tweetdeck</a> est disponible sur tous les\nenvironnements.</p></li>\n<li><p>Je fais ma veille majoritairement via Twitter; j'écrème au fil de la journée\nce qui m'intéresse ou non. Si c'est rapide à lire alors je le lis, sinon je\n<em>bookmark</em> l'article en &quot;Read later&quot; sur mon navigateur. Cela permet de trier\nrapidement l'information et de lire plus paisiblement cela au moment opportun.\nDe plus, étant donné que l'information est donnée par mes <em>following</em> et que\nje suis les personnes qui m'intéressent vraiment, l'information est alors\nsouvent pertinente. Encore faut-il avoir la bonne TL. Et si j'ai besoin\nd'aller chercher une information précise, j'irai la trouver à travers un\nmoteur de recherche... donc aucune problématique de &quot;neutralité&quot; de\nl'information.</p></li>\n<li><p>De plus, étant donné que je fais justement cette veille via Twitter, cela me\npermet d'avoir qu'un seul outil. Cela m'ennuie au plus haut point de\ncollectionner les outils. Je suis certes partisant d'utiliser le bon outil\npour chaque tâche plutôt qu'un couteau-suisse, mais finalement Twitter et un\nlecteur de flux ne sont pas si éloignés.</p></li>\n<li><p>Enfin, la majorité des blogs / sites que j'apprécie ont leur propre compte\ntwitter qui postent l'url de leurs articles, il suffit alors de les suivre. Et\nsi ce n'est pas le cas, je vous montrerai une petite astuce pour que ça le\nsoit.</p></li>\n</ul>\n<p>Vous vous sentez chaud(e) pour commencer ? Très bien, c'est parti !</p>\n<h2>Créer une liste Twitter</h2>\n<p>Pour créer une liste, aucun problème, vous allez dans &quot;Me&quot; dans le <em>header</em> puis\n&quot;List&quot; dans la colonne de gauche pour vous retrouver ici :</p>\n<p><img src=\"/public/images/articles/2014-02-26-twitter-comme-lecteur-de-flux/twitter-list.jpg\" alt=\"\" /></p>\n<p>Puis vous cliquez sur <code>Create list</code> et vous rentrez les informations que vous\nsouhaitez :</p>\n<p><img src=\"/public/images/articles/2014-02-26-twitter-comme-lecteur-de-flux/create-list.png\" alt=\"\" /></p>\n<p>Nous voilà avec notre belle liste. Il n'y a plus qu'à la remplir de jolis\n<em>following</em>.</p>\n<p>Prenons par exemple <code>@nodenpm</code>, un beau <em>bot</em> tweetant les nouveaux packages\nnode.js ou/et les updates de ces packages.</p>\n<p><img src=\"/public/images/articles/2014-02-26-twitter-comme-lecteur-de-flux/nodenpm.jpg\" alt=\"\" /></p>\n<p>Ajoutons-le à notre liste.</p>\n<p><img src=\"/public/images/articles/2014-02-26-twitter-comme-lecteur-de-flux/add-in-list.png\" alt=\"\" /></p>\n<p>Nous voilà maintenant avec notre liste comprenant un <em>following</em>. Ce qui en\nayant ajouté quelques comptes donnera quelque chose comme ceci :</p>\n<p><img src=\"/public/images/articles/2014-02-26-twitter-comme-lecteur-de-flux/twitter-list-read.jpg\" alt=\"\" /></p>\n<p>Vous pouvez maintenant apprécier votre lecteur de flux.</p>\n<p>Oh mais ! C'est là que vous constatez qu'un de vos sites préférés n'a pas de\ncompte Twitter ! Que faire ? Haha, et si on utilisait la puissance de IFTTT pour\nse créer un bot twitter qui tweet chaque nouvel article d'un des sites que vous\nappréciez ?! Mais ouais !</p>\n<h2>IFTTT, la solution pour parfaire notre lecteur</h2>\n<p>Mais avant tout, créons notre compte twitter &quot;bot&quot; qui va tweeter ce qu'on\nsouhaite.</p>\n<h3>Compte twitter &quot;bot&quot;</h3>\n<ul>\n<li>Déconnectez-vous</li>\n<li>Inscrivez-vous à nouveau sur Twitter (le mien s'appelle\n<a href=\"https://twitter.com/kud_feeds\">@kud_feeds</a> par exemple)</li>\n<li>Mettez-lui une belle bio, un bel avatar</li>\n<li>Déconnectez-vous à nouveau</li>\n<li>Connectez-vous avec votre vrai compte</li>\n<li>Ajoutez votre &quot;bot&quot; à la liste que vous venez de créer précédemment</li>\n</ul>\n<p>... et voilà !</p>\n<h3>IFTTT</h3>\n<p><img src=\"/public/images/articles/2014-02-26-twitter-comme-lecteur-de-flux/ifttt.png\" alt=\"\" /></p>\n<p>Maintenant, IFTTT.</p>\n<blockquote>\n<p>IFTTT (&quot;If This Then That&quot;) est un service qui permet aux utilisateurs de\nconnecter différentes applications ensemble à travers de simples conditions\nnommées &quot;recettes&quot;.</p>\n</blockquote>\n<p>IFTTT va vous permettre d'aller pomper les flux {rss|atom} de vos sites préférés\npuis ayant accès à votre <em>bot</em> va permettre de tweeter le contenu des flux !\nC'est pas beau ça hein ?! =)</p>\n<ul>\n<li>Allez sur <a href=\"https://ifttt.com\">ifttt.com</a></li>\n<li>Créez-vous un compte (je vous conseille de créer un compte spécialement pour\nle <em>bot</em> car IFTTT ne propose de relier qu'un seul compte twitter. Du coup, si\ncomme moi vous appréciez IFTTT et que vous souhaitez autant utiliser IFTTT\npour votre compte twitter principal que votre compte <em>bot</em>, je vous conseille\nde vous créer deux comptes IFTTT)</li>\n<li>Créez une nouvelle recette en cliquant sur <code>Create</code></li>\n<li>Cliquez sur <code>this</code></li>\n<li>Puis <code>feed</code></li>\n<li>Choissisez le <em>trigger</em> (&quot;déclencheur&quot;) que vous souhaitez, moi je prends\nplutôt le premier <code>New feed item</code> (le plus simple)</li>\n<li>Indiquez l'url du flux de votre site, par exemple\n<code>http://dribbble.com/_kud/shots/following.rss</code></li>\n<li>Puis <code>then</code></li>\n<li>Twitter</li>\n<li><code>Post a tweet</code></li>\n<li>Laissez tel quel le <em>template</em> de base pour le moment (vous pourrez le changer\nquand vous serez à l'aise avec IFTTT)</li>\n<li>Mettez la description qui va bien</li>\n</ul>\n<p>Et on est bon.</p>\n<p>Vous avez maintenant une nouvelle recette qui dès qu'un article sortira, un\ntweet de votre <em>bot</em> apparaitra. Vous pouvez d'ailleurs vérifier que tout marche\nbien en cliquant sur la flèche <em>Check Recipe Now</em>.</p>\n<p>Vous n'aurez plus qu'à créer une nouvelle recette en dupliquant cette recette à\nchaque fois que vous voudrez suivre un nouveau flux. Certes éventuellement plus\ncontraignant qu'un vrai lecteur de flux mais vous y gagnerez largement par la\nsuite ;)</p>\n<p>Et voilà, nous avons maintenant une belle liste Twitter qui représentre votre\nlecteur de flux. Voici la mienne : <a href=\"https://twitter.com/_kud/lists/feeds\">https://twitter.com/_kud/lists/feeds</a></p>\n<p>Vous pouvez même pousser le vice en créant plusieurs listes par catégorie mais\nça sous-entend aussi de créer des <em>bots</em> et donc des comptes IFTTT par\ncatégorie. Heureusement que j'en ai qu'une. ;)</p>\n<p>Enjoy!</p>\n"}