{"slug":"un-favicon-vite-fait-bien-fait","filename":"2015-11-17-un-favicon-vite-fait-bien-fait","title":"Un favicon vite fait bien fait","date":"Tue, 17 Nov 2015 00:00:00 GMT","draft":false,"meta":{"date":"2015-11-17T00:00:00.000Z","title":"Un favicon vite fait bien fait","author":"phbernard","oldSlug":"favicon","slug":"un-favicon-vite-fait-bien-fait"},"body":"<dl>\n<dt>Oublions un instant CSS et JavaScript pour parler d'un sujet vraiment important</dt>\n<dd>le favicon.\n</dd>\n</dl>\n<p>Alors d'accord, le favicon n'est que le petit détail qu'on expédie en fin de\nprojet. Mais oubliez-le et votre client comprendra tout de suite qu'il manque\nquelque chose.</p>\n<p>Dans ce post, nous allons voir comment s'acquitter de cette tâche dans les temps\net les règles de l'art. Et nous ferons intervenir un outil dont je suis\nl'heureux auteur.</p>\n<h2>Vite fait</h2>\n<p>Pourquoi vite fait ? Parce qu'on ne peut pas consacrer trop de temps au favicon.\nL'optimisation pour les smartphones, l'amélioration du score PageSpeed ou encore\nl'augmentation du taux de conversion, voilà des sujets sur lesquels on peut\nplancher des heures, des jours ou bien plus. Mais le favicon, franchement,\nest-ce vraiment la raison à invoquer pour expliquer le retard d'un projet ? Un\ndétail qu'on vous dit !</p>\n<p>Pour créer un favicon vite fait :</p>\n<ul>\n<li>Créez un <code>favicon.ico</code> avec n'importe quel générateur trouvé sur le net.\nDéclarez-le avec <code>&lt;link rel=&quot;icon&quot; href=&quot;favicon.ico&quot; type=&quot;image/x-icon&quot;&gt;</code>.\nOu peut-être\n<code>&lt;link rel=&quot;shortcut icon&quot; href=&quot;favicon.ico&quot; type=&quot;image/x-icon&quot;&gt;</code> ? Non\nparce qu'on trouve les deux. Dans le doute, déclarez-le deux fois.</li>\n<li>Créez une Touch icon (pour iOS et les autres). Si on en croit les résultats\npour &quot;apple touch icon size&quot; sur Google, la taille maximale est 144x144.</li>\n</ul>\n<p>Voilà. Si vous faites tout ça, vous vous serez acquitté de la tâche rapidement.\nBon, ça sera mal fait, mais fait. C'est un début.</p>\n<h2>Bien fait</h2>\n<p>À présent, penchons-nous sur les difficultés qui nous attendent.</p>\n<h3>C'est la taille qui compte</h3>\n<p>Ça ne fait pas plaisir à entendre et pourtant nous sommes au cœur du problème\n(nous parlons bien de favicon).</p>\n<p><code>favicon.ico</code> devrait-il être en 16x16 ou 32x32 ?\n<a href=\"https://msdn.microsoft.com/library/gg491740(v=vs.85).aspx\">Les deux, selon Microsoft</a>.\nQuelle est la taille de la Touch icon d'Apple ?\n<a href=\"https://developer.apple.com/library/ios/documentation/UserExperience/Conceptual/MobileHIG/IconMatrix.html#//apple_ref/doc/uid/TP40006556-CH27-SW2\">180x180 depuis iOS 8</a>.\nLa tuile <code>square70x70logo</code> pour Windows 8 et 10, c'est... du 70x70, hein ? Moui,\nmais\n<a href=\"https://msdn.microsoft.com/library/dn455106(v=vs.85).aspx\">idéalement, 128x128</a>.</p>\n<p>Ça n'est pas tout : encore faut-il trouver ces informations. Google est assez\nvariable sur ce point. Il met dans le mille pour une recherche concernant le\nfavicon classique (16x16 <em>et</em> 32x32), mais échoue, on l'a vu, pour la Touch\nicon. Les éditeurs ne sont pas en reste. Si\n<a href=\"https://developer.apple.com/library/ios/documentation/UserExperience/Conceptual/MobileHIG/IconMatrix.html#//apple_ref/doc/uid/TP40006556-CH27-SW2\">Apple indique bien les dimensions attendues pour l'iPhone 6</a>,\nil a en revanche\n<a href=\"https://developer.apple.com/library/ios/documentation/AppleApplications/Reference/SafariWebContent/ConfiguringWebApplications/ConfiguringWebApplications.html\">oublié de mettre à jour sa page qui sort pourtant en premier résultat pour la recherche &quot;apple touch icon&quot;</a>\n(152x152 d'après elle).</p>\n<p>Le <a href=\"https://github.com/audreyr/favicon-cheat-sheet\">favicon cheat sheet</a> est une\nressource intéressante à ce titre, quoique pas à jour à l'heure où ces lignes\nsont écrites.</p>\n<p>Bref, le temps de rassembler toutes ces informations et l'après-midi s'est\nenvolé. Oups.</p>\n<p>Ce que je décris ici est le premier problème auquel je me suis frotté il y a un\npeu plus de deux ans, alors que j'achevais mon premier site responsive et que je\nvoulais une icône digne de ce nom.</p>\n<h3>Le design. Vraiment.</h3>\n<p>Allez, j'ai fait dans l'anxiogène avec ces histoires de taille mais en réalité\nce problème a été largement amoindri ces derniers mois avec l'arrivée de\ngénérateurs de favicon de nouvelle génération. Et vous en aurez pour votre\nargent (d'autant qu'ils sont gratuits) : envoyez votre image et vous vous\nretrouverez avec plus d'une vingtaine d'images. C'est beaucoup, presque trop\ndiront certains.</p>\n<p>Mais cette solution cache un problème presque plus grave. Si votre image\noriginale passera bien sur une platforme, elle risque fort de ne pas\ncorrespondre à une autre.</p>\n<p>Prenons l'exemple des icônes pour Android et iOS. Elles servent surtout au <em>Add\nto homescreen</em>, lorsque votre visiteur vous fait l'honneur d'ajouter un lien\nvers votre site sur l'écran de son smartphone. Pas vraiment le moment de le\ndécevoir. Sur Android, beaucoup d'icônes ne sont pas carrées mais exploitent la\ntransparence, notamment les applications natives de Google.</p>\n<p><img src=\"/public/images/articles/2015-11-17-un-favicon-vite-fait-bien-fait/google_apps.png\" alt=\"\" /></p>\n<p>Bonne idée, donc, de suivre ce principe pour notre propre icône. C'est cette\nvoie qu'a choisie mon cerveau auxilière, je veux parler de StackOverflow, et sa\nTouch icône transparente.</p>\n<p><img src=\"/public/images/articles/2015-11-17-un-favicon-vite-fait-bien-fait/so_android.png\" alt=\"\" /></p>\n<p>Sur iOS et son univers tout de parallélépipèdes aux coins arrondis, point de\ntransparence en revanche. L'icône de StackOverflow se voit affublée d'un fond\nnoir. Le résultat n'est pas si mauvais, mais était-ce vraiment voulu ?</p>\n<p><img src=\"/public/images/articles/2015-11-17-un-favicon-vite-fait-bien-fait/so_ios.png\" alt=\"\" /></p>\n<p>Passer son image à la moulinette pour en tirer une vingtaine d'icônes est une\nfausse bonne idée. Elle donne la dangereuse illusion d'un travail bien fait\nalors qu'en réalité vous n'avez pas de réel moyen de savoir ce que vous venez de\nfaire. Sauf à tester vos icônes sur différents appareils et navigateurs, mais là\nce sont encore quelques heures qui partent en fumée.</p>\n<p>Et voilà quel était le second problème que j'ai découvert dans ma quête d'une\nicône correcte. Un <code>-resize</code> d'ImageMagick et un script bash un peu brutal ne\nsuffisent pas.</p>\n<p>Cela a donné le coup d'envoi à\n<a href=\"https://realfavicongenerator.net/\">RealFaviconGenerator.net</a>, un générateur de\nfavicon qui devait vraiment solutionner le problème.</p>\n<p>Il n'y a pas grand chose à dire sur le sujet, et c'est le but: n'oublions pas\nque nous n'avons que peu de temps. Rendez-vous sur RealFaviconGenerator.net,\npostez votre image, éditez vos icônes plate-forme par plate-forme et vous voilà\navec ce qu'il faut d'images, de fichiers annexes et de code HTML pour configurer\nvotre favicon.</p>\n<p><img src=\"/public/images/articles/2015-11-17-un-favicon-vite-fait-bien-fait/favicon_editor.png\" alt=\"\" /></p>\n<p>Voilà, c'est terminé.</p>\n<h3>Se mettre à la page</h3>\n<p>Ou presque.</p>\n<p>Il y a encore quelques années, il était normal de télécharger un framework\nJavaScript à la main puis de le déposer tel quel dans un projet Web.\nAujourd'hui, cela est considéré comme une mauvaise pratique et on préférera\nutiliser un package manager.</p>\n<p>Est-il souhaitable d'industrialiser le favicon de la même manière ? Voyons voir\nce qu'il s'est passé en un an :</p>\n<ul>\n<li>L'Iphone 6 est sorti, et avec lui la touch icon en 180x180 (avant c'était\n152x152).</li>\n<li>Android Chrome a cessé d'utiliser l'icône en 196x196 qui était autrefois\nspécifiée. À la place, il utilise une icône en 192x192 (et snobe la précédente\nquoi qu'il arrive).</li>\n<li>Oubliez cette histoire d'icône en 192x192, Android Chrome utilise désormais un\nmanifeste et plusieurs versions d'icônes pour les différentes densités\nd'écran.</li>\n<li>Apple a sorti une nouvelle icône au format SVG pour les &quot;pinned tabs&quot; de\nSafari pour Mac OS X El Capitan.</li>\n</ul>\n<p>Autrement dit, si vous avez créé un favicon il y a un peu plus d'un an, il y a\nfort à parier qu'il rende mal sur un iPad de dernière génération et le résultat\nsur Android pourrait être assez aléatoire (Chrome utilisera une icône PNG qui\nn'est pas pour lui ou bien une Touch icon).</p>\n<p>À cet effet,\n<a href=\"https://realfavicongenerator.net/api\">RealFaviconGenerator propose une API</a>.\nTout ce qu'il est possible de faire via l'UI peut être reproduit via l'API.\nHum... une API... de la doc à lire... Manifestement, ce n'est pas de cette façon\nqu'on va accélérer les choses. Mais tout n'est pas perdu car le code peut être\ngénéré automatiquement.</p>\n<p>Actuellement, RealFaviconGenerator supporte Grunt et Gulp. Par exemple, après\navoir créé votre favicon, cliquez sur l'onglet &quot;Gulp&quot;. Vous avez le fragment de\nGulpfile ainsi que les instructions pour intégrer votre favicon à votre\nprocessus de build, au même titre que la minification des CSS ou le processing\ndes Coffee scripts.</p>\n<p><img src=\"/public/images/articles/2015-11-17-un-favicon-vite-fait-bien-fait/gulp_instructions.png\" alt=\"\" /></p>\n<p>Les règles :</p>\n<ul>\n<li><code>generate-favicon</code> : génère les icônes. Elle prend quelques secondes et c'est\nle genre de règle qu'on n'exécute qu'une fois de temps en temps, lorsqu'il y a\ndu changement dans le paysage des favicons.</li>\n<li><code>inject-favicon-markups</code> : injecte les déclarations d'icônes dans les pages\nHTML. À exécuter à chaque modification de page, autant dire qu'elle va souvent\nservir.</li>\n<li><code>check-for-favicon-update</code> : vérifie s'il y a du nouveau sur\nRealFaviconGenerator. Si c'est le cas, elle fera échouer votre build bien\ncomme il faut. Un peu brutal mais ça a le mérite d'être clair. Si vous avez un\nsystème d'intégration continue, arrangez-vous pour ajouter cette règle à votre\nradar.</li>\n</ul>\n<p>La favicon a toujours été un parent pauvre des projets web, à juste titre. Avec\nla prolifération des plates-formes, le négliger est de plus en plus hasardeux.\nJ'ai conçu RealFaviconGenerator pour apporter un peu d'ordre à tout cela. Ce\nn'est pas la seule initiative. Hayden Bleasel développe\n<a href=\"https://github.com/haydenbleasel/favicons\">favicons</a> qui ambitionne d'être\n<a href=\"https://github.com/google/web-starter-kit/issues/599\">intégré au Web Starter Kit de Google</a>.</p>\n<p>Et maintenant, c'est à vous : que pensez-vous de la formule &quot;génération de\nGulp/Grunt/autre&quot; ? Quelles sont les technos que vous aimeriez trouver ?</p>\n"}